micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal.h
/**
  ******************************************************************************
  * @file    stm32n6xx_hal.h
  * @author  MCD Application Team
  * @brief   This file contains all the functions prototypes for the HAL
  *          module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32N6xx_HAL_H
#define __STM32N6xx_HAL_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal_conf.h"

/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

/** @addtogroup HAL
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup HAL_Exported_Types HAL Exported Types
  * @{
  */

/** @defgroup HAL_TICK_FREQ Tick Frequency
  * @{
  */
typedef enum
{
  HAL_TICK_FREQ_10HZ         = 100U,
  HAL_TICK_FREQ_100HZ        = 10U,
  HAL_TICK_FREQ_1KHZ         = 1U,
  HAL_TICK_FREQ_DEFAULT      = HAL_TICK_FREQ_1KHZ
} HAL_TickFreqTypeDef;
/**
  * @}
  */

/**
  * @}
  */

/* Exported variables --------------------------------------------------------*/
/** @defgroup HAL_Exported_Variables HAL Exported Variables
  * @{
  */
extern __IO uint32_t            uwTick;
extern uint32_t                 uwTickPrio;
extern HAL_TickFreqTypeDef      uwTickFreq;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup HAL_Exported_Constants HAL Exported Constants
  * @{
  */

/**
  * @brief STM32N6xx HAL Driver version number
  */
#define __STM32N6xx_HAL_VERSION_MAIN   (0x01U) /*!< [31:24] main version */
#define __STM32N6xx_HAL_VERSION_SUB1   (0x01U) /*!< [23:16] sub1 version */
#define __STM32N6xx_HAL_VERSION_SUB2   (0x00U) /*!< [15:8]  sub2 version */
#define __STM32N6xx_HAL_VERSION_RC     (0x00U) /*!< [7:0]  release candidate */
#define __STM32N6xx_HAL_VERSION         ((__STM32N6xx_HAL_VERSION_MAIN << 24U)  \
                                         |(__STM32N6xx_HAL_VERSION_SUB1 << 16U) \
                                         |(__STM32N6xx_HAL_VERSION_SUB2 << 8U ) \
                                         |(__STM32N6xx_HAL_VERSION_RC))

/**
  * @}
  */

/** @defgroup SYSCFG_Exported_Constants SYSCFG Exported Constants
  * @{
  */

/** @defgroup SYSCFG_BootId Boot Id
  * @{
  */
#define SYSCFG_BOOT_0              SYSCFG_BOOTCR_BOOT0_PD  /*!< Boot 0 selection */
#define SYSCFG_BOOT_1              SYSCFG_BOOTCR_BOOT1_PD  /*!< Boot 1 selection */
/**
  * @}
  */

/** @defgroup SYSCFG_SDMMCId SDMMC Id
  * @{
  */
#define SYSCFG_SDMMC1              SYSCFG_ICNEWRCR_SDMMC1_EARLY_WR_RSP_ENABLE  /*!< SDMMC 1 selection */
#define SYSCFG_SDMMC2              SYSCFG_ICNEWRCR_SDMMC2_EARLY_WR_RSP_ENABLE  /*!< SDMMC 2 selection */
#define SYSCFG_SDMMC_ALL           (SYSCFG_SDMMC1 | SYSCFG_SDMMC2)             /*!< SDMMC 1 & 2 selection */
/**
  * @}
  */

/** @defgroup  SYSCFG_USBId USB Id
  * @{
  */
#define SYSCFG_USB1                SYSCFG_ICNEWRCR_USB1_EARLY_WR_RSP_ENABLE    /*!< USB 1 selection */
#define SYSCFG_USB2                SYSCFG_ICNEWRCR_USB2_EARLY_WR_RSP_ENABLE    /*!< USB 2 selection */
#define SYSCFG_USB_ALL             (SYSCFG_USB1 | SYSCFG_USB2)                 /*!< USB 1 & 2 selection */
/**
  * @}
  */

/** @defgroup SYSCFG_XPUId XPU Id
  * @{
  */
#if defined(SYSCFG_ICNCGCR_NPU_NIC_CG_DISABLE)
#define SYSCFG_NPU_NIC             SYSCFG_ICNCGCR_NPU_NIC_CG_DISABLE           /*!< NPU_NIC clock gating disable selection */
#endif /* defined(SYSCFG_ICNCGCR_NPU_NOCSYSCFG_ICNCGCR_NPU_NIC_CG_DISABLE_CG_DISABLE) */
#define SYSCFG_CPU_NIC             SYSCFG_ICNCGCR_CPU_NIC_CG_DISABLE           /*!< CPU_NIC clock gating disable selection */
#define SYSCFG_CPU_NOC             SYSCFG_ICNCGCR_CPU_NOC_CG_DISABLE           /*!< CPU_NOC clock gating disable selection */
#if defined(SYSCFG_ICNCGCR_NPU_NIC_CG_DISABLE)
#define SYSCFG_CPU_ALL             (SYSCFG_NPU_NIC | SYSCFG_CPU_NIC | SYSCFG_CPU_NOC)
#else
#define SYSCFG_CPU_ALL             (SYSCFG_CPU_NIC | SYSCFG_CPU_NOC)
#endif /* defined(SYSCFG_ICNCGCR_NPU_NIC_CG_DISABLE) */
/**
  * @}
  */

/** @defgroup SYSCFG_Compensation_Cell_Selection Compensation Cell Selection
  * @{
  */
#define SYSCFG_IO_VDDIO2_CELL       0U         /*!< I/O Compensation cell for VDDIO2 */
#define SYSCFG_IO_VDDIO3_CELL       1U         /*!< I/O Compensation cell for VDDIO3 */
#define SYSCFG_IO_VDDIO4_CELL       2U         /*!< I/O Compensation cell for VDDIO4 */
#define SYSCFG_IO_VDDIO5_CELL       3U         /*!< I/O Compensation cell for VDDIO5 */
/**
  * @}
  */

/** @defgroup SYSCFG_IO_Compensation_Code_Config IO Compensation Code config
  * @{
  */
#define SYSCFG_IO_CELL_CODE               0UL                       /*!< Code from the cell */
#define SYSCFG_IO_REGISTER_CODE           1UL                       /*!< Code from the values in the cell code register */
/**
  * @}
  */

/** @defgroup SYSCFG_DELAY_Feedback_Clock       Delay on feedback clock
  * @{
  */
#define SYSCFG_DELAY_FEEDBACK_NONE              0U                                /*!< No delay on the feedback clock */
#define SYSCFG_DELAY_FEEDBACK_HALF_CYCLE        SYSCFG_FMC_RETIMECR_SDFBCLK_180   /*!< Half a cycle delay on the feedback clock */
/**
  * @}
  */


/** @defgroup SYSCFG_FPU_Interrupts FPU Interrupts
  * @{
  */
#define SYSCFG_IT_FPU_IOC              SYSCFG_CM55CR_FPU_IT_EN_0  /*!< Floating Point Unit Invalid operation Interrupt */
#define SYSCFG_IT_FPU_DZC              SYSCFG_CM55CR_FPU_IT_EN_1  /*!< Floating Point Unit Divide-by-zero Interrupt */
#define SYSCFG_IT_FPU_UFC              SYSCFG_CM55CR_FPU_IT_EN_2  /*!< Floating Point Unit Underflow Interrupt */
#define SYSCFG_IT_FPU_OFC              SYSCFG_CM55CR_FPU_IT_EN_3  /*!< Floating Point Unit Overflow Interrupt */
#define SYSCFG_IT_FPU_IDC              SYSCFG_CM55CR_FPU_IT_EN_4  /*!< Floating Point Unit Input denormal Interrupt */
#define SYSCFG_IT_FPU_IXC              SYSCFG_CM55CR_FPU_IT_EN_5  /*!< Floating Point Unit Inexact Interrupt */
#define SYSCFG_IT_FPU_ALL              (SYSCFG_CM55CR_FPU_IT_EN_0 |\
                                        SYSCFG_CM55CR_FPU_IT_EN_1 |\
                                        SYSCFG_CM55CR_FPU_IT_EN_2 |\
                                        SYSCFG_CM55CR_FPU_IT_EN_3 |\
                                        SYSCFG_CM55CR_FPU_IT_EN_4 |\
                                        SYSCFG_CM55CR_FPU_IT_EN_5)

/**
  * @}
  */


/** @defgroup SYSCFG_Lock_items SYSCFG Lock items
  * @brief SYSCFG items to set lock on
  * @{
  */
#define SYSCFG_MPU_NSEC                SYSCFG_CM55CR_LOCKNSMPU            /*!< Non-secure MPU lock (privileged secure or non-secure only) */
#define SYSCFG_VTOR_NSEC               SYSCFG_CM55CR_LOCKNSVTOR           /*!< Non-secure VTOR lock (privileged secure or non-secure only) */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define SYSCFG_DCAIC                   (SYSCFG_CM55CR_LOCKDCAIC)          /*!< Disable access to the instruction cache direct cache access registers DCAICLR
and DCAICRR */
#define SYSCFG_SAU                     (SYSCFG_CM55CR_LOCKSAU)            /*!< SAU lock (privileged secure code only) */
#define SYSCFG_MPU_SEC                 (SYSCFG_CM55CR_LOCKSMPU)           /*!< Secure MPU lock (privileged secure code only) */
#define SYSCFG_VTOR_AIRCR_SEC          (SYSCFG_CM55CR_LOCKSVTAIRCR)       /*!< VTOR_S and AIRCR lock (privileged secure code only) */
#define SYSCFG_LOCK_ALL                (SYSCFG_MPU_NSEC | SYSCFG_VTOR_NSEC | SYSCFG_DCAIC | SYSCFG_SAU | SYSCFG_MPU_SEC | SYSCFG_VTOR_AIRCR_SEC)  /*!< All */
#else
#define SYSCFG_LOCK_ALL                (SYSCFG_MPU_NSEC | SYSCFG_VTOR_NSEC)  /*!< All (privileged secure or non-secure only) */
#endif /* __ARM_FEATURE_CMSE */
/**
  * @}
  */

/** @defgroup SYSCFG_DTCM_size SYSCFG DTCM size
  * @brief DTCM size to be configured
  * @{
  */
#define SYSCFG_DTCM_128K (SYSCFG_CM55TCMCR_CFGDTCMSZ_3)                                /*!< DTCM memory size is 128K */
#define SYSCFG_DTCM_256K (SYSCFG_CM55TCMCR_CFGDTCMSZ_0 | SYSCFG_CM55TCMCR_CFGDTCMSZ_3) /*!< DTCM memory size is 256K */

/**
  * @}
  */

