micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal.h
/** @defgroup SYSCFG_ITCM_size SYSCFG ITCM size
  * @brief ITCM size to be configured
  * @{
  */
#define SYSCFG_ITCM_64K  (SYSCFG_CM55TCMCR_CFGITCMSZ_0 | SYSCFG_CM55TCMCR_CFGITCMSZ_1 | SYSCFG_CM55TCMCR_CFGITCMSZ_2) /*!< ITCM memory size is 64K  */
#define SYSCFG_ITCM_128K (SYSCFG_CM55TCMCR_CFGITCMSZ_3)                                /*!< ITCM memory size is 128K */
#define SYSCFG_ITCM_256K (SYSCFG_CM55TCMCR_CFGITCMSZ_0 | SYSCFG_CM55TCMCR_CFGITCMSZ_3) /*!< ITCM memory size is 256K */

/**
  * @}
  */

/** @defgroup SYSCFG_WRITE_access  WRITE access selection
  * @brief WRITE assess to be configured
  * @{
  */
#define SYSCFG_LOCK_WR_TCM  (SYSCFG_CM55TCMCR_LOCKTCM)  /*!< ITCM memory size is 64K  */
#define SYSCFG_LOCK_WR_ITGU (SYSCFG_CM55TCMCR_LOCKITGU) /*!< Disable writes to registers associated with the ITCM interface security/gating. */
#define SYSCFG_LOCK_WR_DTGU (SYSCFG_CM55TCMCR_LOCKDTGU) /*!< Disable writes to registers associated with the DTCM interface security/gating */
#define SYSCFG_LOCK_WR_ALL  (SYSCFG_CM55TCMCR_LOCKTCM | SYSCFG_CM55TCMCR_LOCKITGU | SYSCFG_CM55TCMCR_LOCKDTGU)  /*!< All writes accesses */
/**
  * @}
  */
/** @defgroup SYSCFG_CACHE_biasing Cache biasing level adjust input selection
  * @brief CACHE biasing level adjust input selection
  * @{
  */
#define SYSCFG_CACHE_BIAS_VNOM            SYSCFG_CM55RWMCR_BC1_CACHE
#define SYSCFG_CACHE_BIAS_VNOM_10_PERCENT SYSCFG_CM55RWMCR_BC2_CACHE
/**
  * @}
  */

/** @defgroup SYSCFG_TCM_biasing biasing level selection
  * @brief TCM biasing level adjust input selection
  * @{
  */
#define SYSCFG_TCM_BIAS_VNOM            SYSCFG_CM55RWMCR_BC1_TCM
#define SYSCFG_TCM_BIAS_VNOM_10_PERCENT SYSCFG_CM55RWMCR_BC2_TCM
/**
  * @}
  */

/** @defgroup SBS_Timer_Break_Inputs Timer Break Inputs
  * @{
  */
#define SYSCFG_CBR_BREAK_LOCK_CORE        SYSCFG_CBR_CM55L         /*!< Cortex-CM55 lockup break lock */
#define SYSCFG_CBR_BREAK_LOCK_PVD         SYSCFG_CBR_PVDL_LOCK     /*!< PVD lock */
#define SYSCFG_CBR_BREAK_LOCK_BKPRAM      SYSCFG_CBR_BKPRAML       /*!< Backup SRAM ECC error break lock */
#define SYSCFG_CBR_BREAK_LOCK_CM55_CACHE  SYSCFG_CBR_CM55CACHEL    /*!< CM55 cache double ECC error lock */
#define SYSCFG_CBR_BREAK_LOCK_CM55_TCM    SYSCFG_CBR_CM55TCML      /*!< CM55 TCM double ECC error lock */
#define SYSCFG_CBR_BREAK_LOCK_ALL         (SYSCFG_CBR_CM55L      |\
                                           SYSCFG_CBR_PVDL_LOCK  |\
                                           SYSCFG_CBR_BKPRAML    |\
                                           SYSCFG_CBR_CM55CACHEL |\
                                           SYSCFG_CBR_CM55TCML)

/**
  * @}
  */

/**
  * @}
  */



/* Exported macros -----------------------------------------------------------*/
/** @defgroup DBGMCU_Exported_Macros DBGMCU Exported Macros
  * @{
  */

/** @brief  Freeze/Unfreeze Peripherals in Debug mode
  */
#if defined(DBGMCU_APB1LFZ1_DBG_TIM2_STOP)
#define __HAL_DBGMCU_FREEZE_TIM2()              SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM2_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM2()            CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM2_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_TIM2_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_TIM3_STOP)
#define __HAL_DBGMCU_FREEZE_TIM3()              SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM3_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM3()            CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM3_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_TIM3_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_TIM4_STOP)
#define __HAL_DBGMCU_FREEZE_TIM4()              SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM4_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM4()            CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM4_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_TIM4_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_TIM5_STOP)
#define __HAL_DBGMCU_FREEZE_TIM5()              SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM5_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM5()            CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM5_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_TIM5_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_TIM6_STOP)
#define __HAL_DBGMCU_FREEZE_TIM6()              SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM6_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM6()            CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM6_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_TIM6_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_TIM7_STOP)
#define __HAL_DBGMCU_FREEZE_TIM7()              SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM7_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM7()            CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM7_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_TIM7_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_TIM10_STOP)
#define __HAL_DBGMCU_FREEZE_TIM10()             SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM10_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM10()           CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM10_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_TIM10_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_TIM11_STOP)
#define __HAL_DBGMCU_FREEZE_TIM11()             SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM11_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM11()           CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM11_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_TIM11_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_TIM12_STOP)
#define __HAL_DBGMCU_FREEZE_TIM12()             SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM12_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM12()           CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM12_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_TIM12_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_TIM13_STOP)
#define __HAL_DBGMCU_FREEZE_TIM13()             SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM13_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM13()           CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM13_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_TIM13_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_TIM14_STOP)
#define __HAL_DBGMCU_FREEZE_TIM14()             SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM14_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM14()           CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_TIM14_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_TIM14_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_LPTIM1_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM1()            SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_LPTIM1_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM1()          CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_LPTIM1_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_LPTIM1_STOP) */

