micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal.h
#if defined(DBGMCU_APB1LFZ1_DBG_WWDG1_STOP)
#define __HAL_DBGMCU_FREEZE_WWDG()             SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_WWDG1_STOP)
#define __HAL_DBGMCU_UNFREEZE_WWDG()           CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_WWDG1_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_WWDG1_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_I2C1_STOP)
#define __HAL_DBGMCU_FREEZE_I2C1()              SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_I2C1_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C1()            CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_I2C1_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_I2C1_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_I2C2_STOP)
#define __HAL_DBGMCU_FREEZE_I2C2()              SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_I2C2_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C2()            CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_I2C2_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_I2C2_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_I2C3_STOP)
#define __HAL_DBGMCU_FREEZE_I2C3()              SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_I2C3_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C3()            CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_I2C3_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_I2C3_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_I3C1_STOP)
#define __HAL_DBGMCU_FREEZE_I3C1()              SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_I3C1_STOP)
#define __HAL_DBGMCU_UNFREEZE_I3C1()            CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_I3C1_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_I3C1_STOP) */

#if defined(DBGMCU_APB1LFZ1_DBG_I3C2_STOP)
#define __HAL_DBGMCU_FREEZE_I3C2()              SET_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_I3C2_STOP)
#define __HAL_DBGMCU_UNFREEZE_I3C2()            CLEAR_BIT(DBGMCU->APB1LFZ1, DBGMCU_APB1LFZ1_DBG_I3C2_STOP)
#endif /* defined(DBGMCU_APB1LFZ1_DBG_I3C2_STOP) */

#if defined(DBGMCU_APB1HFZ1_DBG_FDCAN_STOP)
#define __HAL_DBGMCU_FREEZE_FDCAN()             SET_BIT(DBGMCU->APB1HFZ1, DBGMCU_APB1HFZ1_DBG_FDCAN_STOP)
#define __HAL_DBGMCU_UNFREEZE_FDCAN()           CLEAR_BIT(DBGMCU->APB1HFZ1, DBGMCU_APB1HFZ1_DBG_FDCAN_STOP)
#endif /* defined(DBGMCU_APB1HFZ1_DBG_FDCAN_STOP) */

#if defined(DBGMCU_APB2FZ1_DBG_TIM1_STOP)
#define __HAL_DBGMCU_FREEZE_TIM1()              SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM1_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM1()            CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM1_STOP)
#endif /* defined(DBGMCU_APB2FZ1_DBG_TIM1_STOP) */

#if defined(DBGMCU_APB2FZ1_DBG_TIM8_STOP)
#define __HAL_DBGMCU_FREEZE_TIM8()              SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM8_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM8()            CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM8_STOP)
#endif /* defined(DBGMCU_APB2FZ1_DBG_TIM8_STOP) */

#if defined(DBGMCU_APB2FZ1_DBG_TIM18_STOP)
#define __HAL_DBGMCU_FREEZE_TIM18()             SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM18_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM18()           CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM18_STOP)
#endif /* defined(DBGMCU_APB2FZ1_DBG_TIM18_STOP) */

#if defined(DBGMCU_APB2FZ1_DBG_TIM15_STOP)
#define __HAL_DBGMCU_FREEZE_TIM15()             SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM15_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM15()           CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM15_STOP)
#endif /* defined(DBGMCU_APB2FZ1_DBG_TIM15_STOP) */

#if defined(DBGMCU_APB2FZ1_DBG_TIM16_STOP)
#define __HAL_DBGMCU_FREEZE_TIM16()             SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM16_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM16()           CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM16_STOP)
#endif /* defined(DBGMCU_APB2FZ1_DBG_TIM16_STOP) */

#if defined(DBGMCU_APB2FZ1_DBG_TIM17_STOP)
#define __HAL_DBGMCU_FREEZE_TIM17()             SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM17_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM17()           CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM17_STOP)
#endif /* defined(DBGMCU_APB2FZ1_DBG_TIM17_STOP) */

#if defined(DBGMCU_APB2FZ1_DBG_TIM9_STOP)
#define __HAL_DBGMCU_FREEZE_TIM9()              SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM9_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM9()            CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2FZ1_DBG_TIM9_STOP)
#endif /* defined(DBGMCU_APB2FZ1_DBG_TIM9_STOP) */

#if defined(DBGMCU_APB4FZ1_DBG_I2C4_STOP)
#define __HAL_DBGMCU_FREEZE_I2C4()              SET_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_I2C4_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C4()            CLEAR_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_I2C4_STOP)
#endif /* defined(DBGMCU_APB4FZ1_DBG_I2C4_STOP) */

#if defined(DBGMCU_APB4FZ1_DBG_LPTIM2_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM2()            SET_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_LPTIM2_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM2()          CLEAR_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_LPTIM2_STOP)
#endif /* defined(DBGMCU_APB4FZ1_DBG_LPTIM2_STOP) */

#if defined(DBGMCU_APB4FZ1_DBG_LPTIM3_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM3()            SET_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_LPTIM3_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM3()          CLEAR_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_LPTIM3_STOP)
#endif /* DBGMCU_APB4FZ1_DBG_LPTIM3_STOP */

#if defined(DBGMCU_APB4FZ1_DBG_LPTIM4_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM4()            SET_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_LPTIM4_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM4()          CLEAR_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_LPTIM4_STOP)
#endif /* DBGMCU_APB4FZ1_DBG_LPTIM4_STOP */

#if defined(DBGMCU_APB4FZ1_DBG_LPTIM5_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM5()            SET_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_LPTIM5_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM5()          CLEAR_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_LPTIM5_STOP)
#endif /* DBGMCU_APB4FZ1_DBG_LPTIM5_STOP */

#if defined(DBGMCU_APB4FZ1_DBG_RTC_STOP)
#define __HAL_DBGMCU_FREEZE_RTC()               SET_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_RTC_STOP)
#define __HAL_DBGMCU_UNFREEZE_RTC()             CLEAR_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_RTC_STOP)
#endif /* DBGMCU_APB4FZ1_DBG_RTC_STOP */

#if defined(DBGMCU_APB4FZ1_DBG_IWDG_STOP)
#define __HAL_DBGMCU_FREEZE_IWDG()              SET_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_IWDG_STOP)
#define __HAL_DBGMCU_UNFREEZE_IWDG()            CLEAR_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4FZ1_DBG_IWDG_STOP)
#endif /* DBGMCU_APB4FZ1_DBG_IWDG_STOP */

#if defined(DBGMCU_APB5FZ1_DBG_GFXTIM_STOP)
#define __HAL_DBGMCU_FREEZE_GFXTIM()            SET_BIT(DBGMCU->APB5FZ1, DBGMCU_APB5FZ1_DBG_GFXTIM_STOP)
#define __HAL_DBGMCU_UNFREEZE_GFXTIM()          CLEAR_BIT(DBGMCU->APB5FZ1, DBGMCU_APB5FZ1_DBG_GFXTIM_STOP)
#endif /* DBGMCU_APB5FZ1_DBG_GFXTIM_STOP */

