micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal.h
#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH0_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH0()        SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH0_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH0()      CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH0_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH0_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH1_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH1()        SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH1_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH1()      CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH1_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH1_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH2_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH2()        SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH2_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH2()      CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH2_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH2_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH3_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH3()        SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH3_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH3()      CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH3_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH3_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH4_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH4()        SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH4_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH4()      CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH4_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH4_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH5_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH5()        SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH5_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH5()      CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH5_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH5_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH6_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH6()        SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH6_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH6()      CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH6_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH6_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH7_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH7()        SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH7_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH7()      CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH7_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH7_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH8_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH8()        SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH8_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH8()      CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH8_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH8_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH9_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH9()        SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH9_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH9()      CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH9_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH9_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH10_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH10()       SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH10_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH10()     CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH10_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH10_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH11_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH11()       SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH11_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH11()     CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH11_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH11_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH12_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH12()       SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH12_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH12()     CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH12_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH12_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH13_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH13()       SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH13_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH13()     CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH13_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH13_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH14_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH14()       SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH14_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH14()     CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH14_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH14_STOP */

#if defined(DBGMCU_AHB1FZ1_DBG_GPDMA1_CH15_STOP)
#define __HAL_DBGMCU_FREEZE_GPDMA1_CH15()       SET_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH15_STOP)
#define __HAL_DBGMCU_UNFREEZE_GPDMA1_CH15()     CLEAR_BIT(DBGMCU->AHB1FZ1, DBGMCU_AHB1FZ1_DBG_GPDMA1_CH15_STOP)
#endif /* DBGMCU_AHB1FZ1_DBG_GPDMA1_CH15_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH0_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH0()        SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH0_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH0()      CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH0_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH0_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH1_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH1()        SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH1_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH1()      CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH1_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH1_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH2_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH2()        SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH2_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH2()      CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH2_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH2_STOP */

