micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal.h
#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH3_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH3()        SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH3_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH3()      CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH3_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH3_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH4_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH4()        SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH4_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH4()      CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH4_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH4_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH5_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH5()        SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH5_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH5()      CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH5_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH5_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH6_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH6()        SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH6_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH6()      CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH6_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH6_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH7_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH7()        SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH7_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH7()      CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH7_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH7_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH8_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH8()        SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH8_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH8()      CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH8_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH8_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH9_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH9()        SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH9_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH9()      CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH9_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH9_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH10_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH10()       SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH10_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH10()     CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH10_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH10_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH11_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH11()       SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH11_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH11()     CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH11_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH11_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH12_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH12()       SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH12_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH12()     CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH12_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH12_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH13_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH13()       SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH13_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH13()     CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH13_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH13_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH14_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH14()       SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH14_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH14()     CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH14_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH14_STOP */

#if defined(DBGMCU_AHB5FZ1_DBG_HPDMA1_CH15_STOP)
#define __HAL_DBGMCU_FREEZE_HPDMA1_CH15()       SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH15_STOP)
#define __HAL_DBGMCU_UNFREEZE_HPDMA1_CH15()     CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_DBG_HPDMA1_CH15_STOP)
#endif /* DBGMCU_AHB5FZ1_DBG_HPDMA1_CH15_STOP */

#if defined(DBGMCU_AHB5FZ1_NPU_DBG_FREEZE)
#define __HAL_DBGMCU_FREEZE_NPU()               SET_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_NPU_DBG_FREEZE)
#define __HAL_DBGMCU_UNFREEZE_NPU()             CLEAR_BIT(DBGMCU->AHB5FZ1, DBGMCU_AHB5FZ1_NPU_DBG_FREEZE)
#endif /* DBGMCU_AHB5FZ1_NPU_DBG_FREEZE */


/**
  * @}
  */

/** @defgroup SYSCFG_Exported_Macros SYSCFG Exported Macros
  * @{
  */

/** @brief  Floating Point Unit interrupt enable/disable macros
  * @param __INTERRUPT__: This parameter can be a value of @ref SYSCFG_FPU_Interrupts
  */
#define __HAL_SYSCFG_FPU_INTERRUPT_ENABLE(__INTERRUPT__)    do {assert_param(IS_SYSCFG_FPU_INTERRUPT((__INTERRUPT__)));\
                                                                 SET_BIT(SYSCFG->CM55CR, (__INTERRUPT__));\
                                                               }while(0)

#define __HAL_SYSCFG_FPU_INTERRUPT_DISABLE(__INTERRUPT__)   do {assert_param(IS_SYSCFG_FPU_INTERRUPT((__INTERRUPT__)));\
                                                                 CLEAR_BIT(SYSCFG->CM55CR, (__INTERRUPT__));\
                                                               }while(0)

/* Private macros ------------------------------------------------------------*/

/** @defgroup SYSCFG_Private_Macros SYSCFG Private Macros
  * @{
  */
#define IS_SYSCFG_BOOT_ID(__BOOTID__)  ((((__BOOTID__) & SYSCFG_BOOT_0) == SYSCFG_BOOT_0) || \
                                        (((__BOOTID__) & SYSCFG_BOOT_1) == SYSCFG_BOOT_1))

#define IS_SYSCFG_FPU_INTERRUPT(__INTERRUPT__) (((((__INTERRUPT__) & SYSCFG_IT_FPU_IOC) == SYSCFG_IT_FPU_IOC)  || \
                                                 (((__INTERRUPT__) & SYSCFG_IT_FPU_DZC) == SYSCFG_IT_FPU_DZC)  || \
                                                 (((__INTERRUPT__) & SYSCFG_IT_FPU_UFC) == SYSCFG_IT_FPU_UFC)  || \
                                                 (((__INTERRUPT__) & SYSCFG_IT_FPU_OFC) == SYSCFG_IT_FPU_OFC)  || \
                                                 (((__INTERRUPT__) & SYSCFG_IT_FPU_IDC) == SYSCFG_IT_FPU_IDC)  || \
                                                 (((__INTERRUPT__) & SYSCFG_IT_FPU_IXC) == SYSCFG_IT_FPU_IXC)) && \
                                                (((__INTERRUPT__) & ~(SYSCFG_IT_FPU_ALL)) == 0U))

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define IS_SYSCFG_LOCK_ITEMS(__ITEM__) (((((__ITEM__) & SYSCFG_MPU_NSEC)       == SYSCFG_MPU_NSEC)  || \
                                         (((__ITEM__) & SYSCFG_VTOR_NSEC)      == SYSCFG_VTOR_NSEC) || \
                                         (((__ITEM__) & SYSCFG_DCAIC)          == SYSCFG_DCAIC)     || \
                                         (((__ITEM__) & SYSCFG_SAU)            == SYSCFG_SAU)       || \
                                         (((__ITEM__) & SYSCFG_MPU_SEC)        == SYSCFG_MPU_SEC)   || \
                                         (((__ITEM__) & SYSCFG_VTOR_AIRCR_SEC) == SYSCFG_VTOR_AIRCR_SEC)) && \
                                        (((__ITEM__) & ~(SYSCFG_LOCK_ALL)) == 0U))
#else
#define IS_SYSCFG_LOCK_ITEMS(__ITEM__) (((((__ITEM__) & SYSCFG_MPU_NSEC)  == SYSCFG_MPU_NSEC)  || \
                                         (((__ITEM__) & SYSCFG_VTOR_NSEC) == SYSCFG_VTOR_NSEC)) && \
                                        (((__ITEM__) & ~(SYSCFG_LOCK_ALL)) == 0U))
#endif /* __ARM_FEATURE_CMSE */

#define IS_SYSCFG_DTCM_SIZE(__SIZE__) ((((__SIZE__) & SYSCFG_CM55TCMCR_CFGDTCMSZ) == SYSCFG_DTCM_128K)  || \
                                       (((__SIZE__) & SYSCFG_CM55TCMCR_CFGDTCMSZ) == SYSCFG_DTCM_256K))

