micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal.h
#define IS_SYSCFG_ITCM_SIZE(__SIZE__) ((((__SIZE__) & SYSCFG_CM55TCMCR_CFGITCMSZ) == SYSCFG_ITCM_64K)   || \
                                       (((__SIZE__) & SYSCFG_CM55TCMCR_CFGITCMSZ) == SYSCFG_ITCM_128K)  || \
                                       (((__SIZE__) & SYSCFG_CM55TCMCR_CFGITCMSZ) == SYSCFG_ITCM_256K))

#define IS_SYSCFG_LOCK_WRACCESS(__WRACCESS__) (((((__WRACCESS__) & SYSCFG_LOCK_WR_TCM)   == SYSCFG_LOCK_WR_TCM)  || \
                                                (((__WRACCESS__) & SYSCFG_LOCK_WR_ITGU)  == SYSCFG_LOCK_WR_ITGU) || \
                                                (((__WRACCESS__) & SYSCFG_LOCK_WR_DTGU)  == SYSCFG_LOCK_WR_DTGU)) && \
                                               (((__WRACCESS__) & ~(SYSCFG_LOCK_WR_ALL)) == 0U))

#define IS_TCM_MARGIN_INPUT(__MARGIN__)  ((__MARGIN__) < 16U)

#define IS_SYSCFG_CACHE_BIASING_LEVEL(__LEVEL__) ((((__LEVEL__) & (SYSCFG_CM55RWMCR_BC1_CACHE | SYSCFG_CM55RWMCR_BC2_CACHE)) == SYSCFG_CACHE_BIAS_VNOM)             || \
                                                  (((__LEVEL__) & (SYSCFG_CM55RWMCR_BC1_CACHE | SYSCFG_CM55RWMCR_BC2_CACHE)) == SYSCFG_CACHE_BIAS_VNOM_10_PERCENT))

#define IS_SYSCFG_TCM_BIASING_LEVEL(__LEVEL__) ((((__LEVEL__) & (SYSCFG_CM55RWMCR_BC1_TCM | SYSCFG_CM55RWMCR_BC2_TCM)) == SYSCFG_TCM_BIAS_VNOM)  || \
                                                (((__LEVEL__) & (SYSCFG_CM55RWMCR_BC1_TCM | SYSCFG_CM55RWMCR_BC2_TCM)) == SYSCFG_TCM_BIAS_VNOM_10_PERCENT))

#define IS_VTOR_ADDRESS(__ADDRESS__) (((__ADDRESS__) & 0x7FU) == 0U)

#define IS_SYSCFG_QOS_CPU(__QOS__) ((__QOS__) < 16U)

#define IS_SYSCFG_SDMMC(__SDMMC__) (((((__SDMMC__) & SYSCFG_SDMMC1) == SYSCFG_SDMMC1) || \
                                     (((__SDMMC__) & SYSCFG_SDMMC2) == SYSCFG_SDMMC2)) && \
                                    (((__SDMMC__) & ~(SYSCFG_SDMMC_ALL)) == 0U))

#define IS_SYSCFG_USB(__USB__) (((((__USB__) & SYSCFG_USB1) == SYSCFG_USB1) || \
                                 (((__USB__) & SYSCFG_USB2) == SYSCFG_USB2)) && \
                                (((__USB__) & ~(SYSCFG_USB_ALL)) == 0U))

#if defined(SYSCFG_ICNCGCR_NPU_NOC_CG_DISABLE)
#define IS_SYSCFG_CPU_CLK_GATING(__CPU__) (((((__CPU__) & SYSCFG_NPU_NOC) == SYSCFG_NPU_NOC) || \
                                            (((__CPU__) & SYSCFG_CPU_NIC) == SYSCFG_CPU_NIC) || \
                                            (((__CPU__) & SYSCFG_CPU_NOC) == SYSCFG_CPU_NOC)) && \
                                           (((__CPU__) & ~(SYSCFG_CPU_ALL)) == 0U))
#else
#define IS_SYSCFG_CPU_CLK_GATING(__CPU__) (((((__CPU__) & SYSCFG_CPU_NIC) == SYSCFG_CPU_NIC) ||  \
                                            (((__CPU__) & SYSCFG_CPU_NOC) == SYSCFG_CPU_NOC)) && \
                                           (((__CPU__) & ~(SYSCFG_CPU_ALL)) == 0U))
#endif /* defined(SYSCFG_ICNCGCR_NPU_NOC_CG_DISABLE) */

#define IS_SYSCFG_IO_COMPENSATION_CELL_NMOS_VALUE(__VALUE__) (((__VALUE__) < 16U))
#define IS_SYSCFG_IO_COMPENSATION_CELL_PMOS_VALUE(__VALUE__) (((__VALUE__) < 16U))

#define IS_SYSCFG_COMPENSATION_CELL(__VALUE__) (((__VALUE__) == SYSCFG_IO_VDDIO2_CELL) || \
                                                ((__VALUE__) == SYSCFG_IO_VDDIO3_CELL) || \
                                                ((__VALUE__) == SYSCFG_IO_VDDIO4_CELL) || \
                                                ((__VALUE__) == SYSCFG_IO_VDDIO5_CELL))

#define IS_SYSCFG_IO_COMPENSATION_CODE(__CELL__) (((__CELL__) == SYSCFG_IO_CELL_CODE)      || \
                                                  ((__CELL__) == SYSCFG_IO_REGISTER_CODE))

#define IS_SYSCFG_CBR_BREAK_INPUT(__VALUE__) \
  ((((__VALUE__) & SYSCFG_CBR_BREAK_LOCK_ALL) != 0U) && \
   (((__VALUE__) & ~SYSCFG_CBR_BREAK_LOCK_ALL) == 0U))

#define IS_SYSCFG_DMA_CID_SEC(__CID__) (((__CID__) < 8U))

#define IS_SYSCFG_DMA_CID_NON_SEC(__CID__) (((__CID__) < 8U))

#define IS_SYSCFG_DMA_DELAY_FEEDBACK_CLOCK(__DELAY__) (((__DELAY__) == SYSCFG_DELAY_FEEDBACK_NONE)  || \
                                                       ((__DELAY__) == SYSCFG_DELAY_FEEDBACK_HALF_CYCLE))

/**
  * @}
  */


/** @defgroup HAL_Private_Macros HAL Private Macros
  * @{
  */
#define IS_TICKFREQ(FREQ) (((FREQ) == HAL_TICK_FREQ_10HZ)  || \
                           ((FREQ) == HAL_TICK_FREQ_100HZ) || \
                           ((FREQ) == HAL_TICK_FREQ_1KHZ))
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @addtogroup HAL_Exported_Functions
  * @{
  */

/** @addtogroup HAL_Exported_Functions_Group1
  * @{
  */

/* Initialization and de-initialization functions  ******************************/
HAL_StatusTypeDef HAL_Init(void);
HAL_StatusTypeDef HAL_DeInit(void);
void HAL_MspInit(void);
void HAL_MspDeInit(void);
HAL_StatusTypeDef HAL_InitTick(uint32_t TickPriority);

/**
  * @}
  */

/** @addtogroup HAL_Exported_Functions_Group2
  * @{
  */

/* Peripheral Control functions  ************************************************/
void HAL_IncTick(void);
void HAL_Delay(uint32_t Delay);
uint32_t HAL_GetTick(void);
uint32_t HAL_GetTickPrio(void);
HAL_StatusTypeDef HAL_SetTickFreq(HAL_TickFreqTypeDef Freq);
HAL_TickFreqTypeDef HAL_GetTickFreq(void);
void HAL_SuspendTick(void);
void HAL_ResumeTick(void);
uint32_t HAL_GetHalVersion(void);
uint32_t HAL_GetREVID(void);
uint32_t HAL_GetDEVID(void);
uint32_t HAL_GetUIDw0(void);
uint32_t HAL_GetUIDw1(void);
uint32_t HAL_GetUIDw2(void);

/**
  * @}
  */

/** @addtogroup HAL_Exported_Functions_Group3
  * @{
  */

/* DBGMCU Peripheral Control functions  *****************************************/
void HAL_DBGMCU_EnableDBGSleepMode(void);
void HAL_DBGMCU_DisableDBGSleepMode(void);
void HAL_DBGMCU_EnableDBGStopMode(void);
void HAL_DBGMCU_DisableDBGStopMode(void);
void HAL_DBGMCU_EnableDBGStandbyMode(void);
void HAL_DBGMCU_DisableDBGStandbyMode(void);

/** @addtogroup HAL_Exported_Functions_Group4
  * @{
  */

/* SYSCFG Peripheral Control functions  *****************************************/
void HAL_SYSCFG_EnablePullDown(uint32_t BootId);
void HAL_SYSCFG_DisablePullDown(uint32_t BootId);


