micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal.h
void HAL_SYSCFG_Lock(uint32_t Item);
HAL_StatusTypeDef HAL_SYSCFG_GetLock(uint32_t *pItem);

void HAL_SYSCFG_SetTCMSize(uint32_t DtcmSize, uint32_t ItcmSize);
HAL_StatusTypeDef HAL_SYSCFG_GetTCMSize(uint32_t *pDtcmSize, uint32_t *pItcmSize);

void HAL_SYSCFG_LockWriteAccess(uint32_t Item);
HAL_StatusTypeDef HAL_SYSCFG_GetLockWriteAccess(uint32_t *pItem);

void HAL_SYSCFG_EnableITCMWaiteState(void);
void HAL_SYSCFG_DisableITCMWaiteState(void);
void HAL_SYSCFG_EnableDTCMWaiteState(void);
void HAL_SYSCFG_DisableDTCMWaiteState(void);

void HAL_SYSCFG_EnableTCMExternalMargin(void);
void HAL_SYSCFG_DisableTCMExternalMargin(void);

void HAL_SYSCFG_SetTCMRWMarginInput(uint32_t TcmRwMarginInput);
HAL_StatusTypeDef HAL_SYSCFG_GetTCMRWMarginInput(uint32_t *pTcmRwMarginInput);

void HAL_SYSCFG_SetTCMBiasingLevel(uint32_t Level);
HAL_StatusTypeDef HAL_SYSCFG_GetTCMBiasingLevel(uint32_t *pLevel);

void HAL_SYSCFG_EnableCacheExternalMargin(void);
void HAL_SYSCFG_DisableCacheExternalMargin(void);

void HAL_SYSCFG_SetCacheRWMarginInput(uint32_t CacheRWMarginInput);
HAL_StatusTypeDef HAL_SYSCFG_GetCacheRWMarginInput(uint32_t *pCacheRWMarginInput);

void HAL_SYSCFG_SetCacheBiasingLevel(uint32_t Level);
HAL_StatusTypeDef HAL_SYSCFG_GetCacheBiasingLevel(uint32_t *pLevel);


void HAL_SYSCFG_SetSVTORAddress(uint32_t Address);
HAL_StatusTypeDef HAL_SYSCFG_GetSVTORAddress(uint32_t *pAddress);

void HAL_SYSCFG_SetNSVTORAddress(uint32_t Address);
HAL_StatusTypeDef HAL_SYSCFG_GetNSVTORAddress(uint32_t *pAddress);


void HAL_SYSCFG_EnablePowerOnReset(void);
void HAL_SYSCFG_DisablePowerOnReset(void);

void HAL_SYSCFG_EnableLockupWarmResetonRCC(void);
void HAL_SYSCFG_DisableLockupWarmResetonRCC(void);

void HAL_SYSCFG_EnableLockupGenerateNMI(void);
void HAL_SYSCFG_DisableLockupGenerateNMI(void);

HAL_StatusTypeDef HAL_SYSCFG_ReEnableWritePostingErrorCapture(void);

#if defined(VENC)
void HAL_SYSCFG_EnableVENCRAMReserved(void);
void HAL_SYSCFG_DisableVENCRAMReserved(void);
#endif /* VENC */

void HAL_SYSCFG_EnableCRYPPotentialTamper(void);
void HAL_SYSCFG_DisableCRYPPotentialTamper(void);


void HAL_SYSCFG_SetWriteQosNP1(uint32_t QosValue);
HAL_StatusTypeDef HAL_SYSCFG_GetWriteQosNP1(uint32_t *pQosValue);
void HAL_SYSCFG_SetReadQosNP1(uint32_t QosValue);
HAL_StatusTypeDef HAL_SYSCFG_GetReadQosNP1(uint32_t *pQosValue);

void HAL_SYSCFG_SetWriteQosNP2(uint32_t QosValue);
HAL_StatusTypeDef HAL_SYSCFG_GetWriteQosNP2(uint32_t *pQosValue);
void HAL_SYSCFG_SetReadQosNP2(uint32_t QosValue);
HAL_StatusTypeDef HAL_SYSCFG_GetReadQosNP2(uint32_t *pQosValue);

void HAL_SYSCFG_SetWriteQosCPUSS(uint32_t QosValue);
HAL_StatusTypeDef HAL_SYSCFG_GetwriteQosCPUSS(uint32_t *pQosValue);
void HAL_SYSCFG_SetReadQosCPUSS(uint32_t QosValue);
HAL_StatusTypeDef HAL_SYSCFG_GetReadQosCPUSS(uint32_t *pQosValue);


void HAL_SYSCFG_EnableSDMMCEarlyWRRESP(uint32_t Sdmmc);
void HAL_SYSCFG_DisableSDMMCEarlyWRRSP(uint32_t Sdmmc);

void HAL_SYSCFG_EnableUSBEarlyEarlyWRRESP(uint32_t Usb);
void HAL_SYSCFG_DisableUSBEarlyEarlyWRRESP(uint32_t Usb);


void HAL_SYSCFG_EnablexPUClockGating(uint32_t Xpu);
void HAL_SYSCFG_DisablexPUClockGating(uint32_t Xpu);




void HAL_SYSCFG_EnableVDDIO2CompensationCell(void);
void HAL_SYSCFG_DisableVDDIO2CompensationCell(void);

void HAL_SYSCFG_EnableVDDIO3CompensationCell(void);
void HAL_SYSCFG_DisableVDDIO3CompensationCell(void);

void HAL_SYSCFG_EnableVDDIO4CompensationCell(void);
void HAL_SYSCFG_DisableVDDIO4CompensationCell(void);

void HAL_SYSCFG_EnableVDDIO5CompensationCell(void);
void HAL_SYSCFG_DisableVDDIO5CompensationCell(void);


HAL_StatusTypeDef HAL_SYSCFG_ConfigVDDIOCompensationCell(uint32_t Selection, uint32_t Code,
                                                         uint32_t NmosValue, uint32_t PmosValue);

HAL_StatusTypeDef HAL_SYSCFG_GetVDDIOCompensationCell(uint32_t Selection, const uint32_t *pCode, uint32_t *pNmosValue,
                                                      uint32_t *pPmosValue);


uint32_t HAL_SYSCFG_GetCompVDDIO2CellReadyStatus(void);
uint32_t HAL_SYSCFG_GetCompVDDIO3CellReadyStatus(void);
uint32_t HAL_SYSCFG_GetCompVDDIO4CellReadyStatus(void);
uint32_t HAL_SYSCFG_GetCompVDDIO5CellReadyStatus(void);

HAL_StatusTypeDef HAL_SYSCFG_ConfigVDDCompensationCell(uint32_t Code, uint32_t NmosValue, uint32_t PmosValue);

void HAL_SYSCFG_EnableVDDCompensationCell(void);
void HAL_SYSCFG_DisableVDDCompensationCell(void);

HAL_StatusTypeDef HAL_SYSCFG_GetVDDCompensationCell(uint32_t Code, uint32_t *pNmosValue,
                                                 uint32_t *pPmosValue);
uint32_t HAL_SYSCFG_GetCompensationVDDCellReadyStatus(void);

void HAL_SYSCFG_ConfigTimerBreakInput(uint32_t Input);
uint32_t HAL_SYSCFG_GetTimerBreakInputConfig(void);

void HAL_SYSCFG_SetPerceivedCID(uint32_t Cid);
uint32_t HAL_SYSCFG_GetPerceivedCID(void);

void HAL_SYSCFG_SetPerceivedPrivCID(uint32_t Cid);
uint32_t HAL_SYSCFG_GetPerceivedPrivCID(void);

void HAL_SYSCFG_EnableReTimingRXpath(void);
void HAL_SYSCFG_DisableReTimingRXpath(void);

void HAL_SYSCFG_EnableReTimingTXpath(void);
void HAL_SYSCFG_DisableReTimingTXpath(void);

void HAL_SYSCFG_SetDelayOnFeedbackClock(uint32_t Delay);
uint32_t HAL_SYSCFG_GetDelayOnFeedbackClock(void);

void HAL_SYSCFG_EnableInterleavingCpuRam(void);
void HAL_SYSCFG_DisableInterleavingCpuRam(void);

uint32_t HAL_SYSCFG_GetBootPinConnection(uint32_t BootId);

uint32_t HAL_SYSCFG_GetAddressWritePostingBuffer(void);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __STM32N6xx_HAL_H */
